Public Attributes | List of all members
API_AnalyticalLinkType Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Link. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalLink_Settings  | linkSettings
The Analytical Link settings.
API_AnalyticalMemberPartRef  | startElementPartRef
The Analytical Member reference on one side.
API_AnalyticalMemberPartRef  | endElementPartRef
The Analytical Member reference on the other side.
Detailed Description
Describes a Structural Analytical Model Analytical Link.
Since
Archicad 25
Member Data Documentation
◆ endElementPartRef
 API_AnalyticalLinkType::endElementPartRef
The Analytical Member reference on the other side.
◆ linkSettings
 API_AnalyticalLinkType::linkSettings
The Analytical Link settings.
◆ startElementPartRef
 API_AnalyticalLinkType::startElementPartRef
The Analytical Member reference on one side.